{"pageProps":{"abtData":{"contentHtml":"<p>I'm currently working as a Software Engineer at the <a href=\"https://www.broadinstitute.org/\">Broad Institute</a> of MIT and Harvard. At the Broad, I'm a part of the Translational Genomics Group and am working on the gnomAD browser which seeks to aggregate and share both the data and tools needed to analyze thousands of sequenced human exomes and genomes to the wider scientific community. It is one of the most widely used reference population databases on the internet.</p>\n<p>I'm a Double Husky, having received my Master of Science in Computer Science in the May of 2022, and my Bachelor of Science in Civil Engineering in May of 2020, from <a href=\"https://www.northeastern.edu/\">Northeastern University</a> in Boston, Massachusetts.</p>\n<p>I thru hiked the 3,100 mile <a href=\"https://en.wikipedia.org/wiki/Continental_Divide_Trail\">Continental Divide Trail</a> in 2021, and the 273 mile <a href=\"https://en.wikipedia.org/wiki/Long_Trail\">Long Trail</a> in 2020. My Trail Name is Bellows, and I love to be in the backcountry. Ask me about my pack's base weight (currently 12 pounds!). I also biked ~4,300 miles in 49 days from from Washington, D.C. to Astoria, Oregon in 2022. I took the <a href=\"https://www.easternexpressroute.com/\">Eastern Express</a> route until meeting up with the traditional <a href=\"https://www.adventurecycling.org/routes-and-maps/adventure-cycling-route-network/transamerica-trail/\">Trans America</a> route in Colorado.</p>\n<p>Now that months long adventures are more difficult to fit into my schedule, I've turned towards running long distances. I ran the <a href=\"https://vermont100.com\">Vermont 100</a> in 2024, finishing in ~22.5 hours. I've also ran the Philmont 50 twice, the Heartland 50 once, numerous marathons, and ran Rim to Rim to Rim (<a href=\"https://ultrarunning.com/features/destinations/grand-canyon-basics-rim-to-rim-to-rim/%7D\">R2R2R</a>) in the Grand Canyon in October of 2023 in about 13 hours.</p>\n<p>My band recently released our <a href=\"https://linktr.ee/FireontheMountain\">first single</a>, and in addition to being a part of this group, I love to play Jazz. I'm currently really digging Barry Harris, Ryo Fukui, and The Ezra Collective.</p>\n","title":"More About Me"}},"__N_SSG":true}